/************************************************************************
				特殊桶排序 -- 基数排序（桶的个数总为 10 *（n+1）：[10, n+1]）

	(1)分配：先从个位开始，根据位值(0-9)分别放到0~9号桶中（比如53,个位为3，则放入3号桶中）
	(2)收集：再将放置在0~9号桶中的数据按顺序放到数组中
	重复(1)(2)过程，从个位到最高位（比如32位无符号整形最大数4294967296，最高10位数（1～9））

- 平均时间复杂度：O(dn)(d即表示整形的最高位数)


- 空间复杂度：O(10*(n+1)) （10表示0~9，用于存储临时的序列） //桶数

- 稳定性：稳定

**************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

/********************************************************
*函数名称：GetNumInPos
*参数说明：num 一个整形数据
*		   pos 表示要获得的整形的第pos位数据(1~10整形数据的最高位数为十位数字)
*说明：    找到num的从低到高的第pos位的数据
*********************************************************/
int GetNumInPos(int num,int pos)
{
	int temp = 1;
	for (int i = 0; i < pos - 1; i++)
		temp *= 10;
	
	return (num / temp) % 10;// 取商再取余
}

/**************************************************************************************************
*函数名称：RadixSort
*参数说明：pDataArray 无序数组；
*		   iDataNum为无序数据个数
*说明：    基数排序

*列数为：n+1 -->  第0列存放此行存储数据个数; 
				第（1～n）列存放存入此行的未排序元素(因为可能待排的数组可能全是{100,199,123,124,145,178,124,167,128...})
				在取出百位数均为1，所以要存下这些数，必须要第1行的列数为n；
				即：radixArrays[1][0]=n, radixArrays[1][1]~radixArrays[1][n]为原数组的数

--> 分配：将待排数组放进桶中
作为桶的数组：radixArrays[10][n+1] 
     0 1 2 3 4 5 ...n
| 0
| 1
| 2
| 3
| 4
| 5
| 6
| 7
| 8
| 9
 基数（0～9:各个位）
*******************************************************************************************************/
#define RADIX_10 10    // radix(十进制数，基数)-- 0～9
#define KEYNUM_31 10   // int整型的最大值是十位数（所以位数就是从1～10）
void RadixSort(int* pDataArray, int n)
{
	// 桶初始化:[10][n+1]
	int *radixArrays[RADIX_10];    //分别为0~9的序列空间（基数）
	for (int i = 0; i < 10; i++)
	{
		// n+1列
		radixArrays[i] = (int *)malloc(sizeof(int) * (n + 1));
		// 第0列放这组数据的个数
		radixArrays[i][0] = 0;    //index为0处记录这组数据的个数
	}
	
	// 最低位优先(Least Significant Digit first)LSD
	for (int pos = 1; pos <= KEYNUM_31; pos++)    //从个位开始到第10位（个，十，百，千，万...：1～10）
	{

		// 分配过程 -- 将原数组中的数，放入相对应的行中
		for (int i = 0; i < n; i++)    
		{
			// 取出的个位/十位/百位的数存到相应数字的行里
			int num = GetNumInPos(pDataArray[i], pos);
			int index = ++radixArrays[num][0];  // 第num行，桶内计数
			radixArrays[num][index] = pDataArray[i]; // 将原数组元素放到等于num的行（桶）中
		}
 		
 		// 收集过程 -- 从0~9各行: i依次取出放回原数组（初排序）； j负责放回原数组的下标递加 
		for (int i = 0, j =0; i < RADIX_10; i++)    
		{
			// 依次取出每一行元素放回原数组
			for (int k = 1; k <= radixArrays[i][0]; k++)
				pDataArray[j++] = radixArrays[i][k];

			// 将此行的首位置0，进行下一次循环（个位排完了进十位，十位完了进百位...）
			radixArrays[i][0] = 0;    //复位
		}
	}
}

void traveral(int a[], int n)
{
	for (int i = 0; i < n; ++i)
	{
		printf("%d ", a[i]);
	}
	printf("\n");
}

int main()
{
	GetNumInPos(234, 1);
	int a[20] = {2, 34, 23, 33, 123, 333, 653, 763, 23, 75, 54, 34, 24, 2, 4, 64, 74, 84, 93, 22};
	printf("排序前：\n");
	traveral(a, 20);

	RadixSort(a, 20);
	printf("排序后：\n");
	traveral(a, 20);
	return 0;
}